#include <iostream>
using namespace std;
void main()
{
	setlocale(LC_ALL, "Rus");
	char answer1, answer2, answer3, answer4, answer5, answer6, answer7, answer8, answer9;
	int a = 0;
	int b = 0;
	cout << "\t\t\tАнкета пацiєнта з пiдозрою на COVID-19 при первинному медичному оглядi : \n" << endl;//Заполните анкету 
	cout << "\tГарячка: " << "a) гарячка до 38°С, що добре контролюється прийомом жарознижуючих препаратiв;" << "\n" << "\t\t" << " b) гарячка вище 38°С, що не контролюється прийомом жарознижуючих препаратiв;" << endl;
	cin >> answer1;
	if (answer1 == 'a')

	{
		a++;
	}


	cout << "\tКашель: " << " a) сухий кашель без задишки;" << "\n" << "\t\t" << " b) сухий кашель iз задишкою (SpO2>93%); с) утруднене дихання (неможливість говорити повних речень, втягування міжребенних проміжків, дистанційні хрипи тощо), або сатурація - spo2 нижче 93%, або кровохаркання, або тахі- , брадіпное або апное, або блідість, мраморність шкірних покривів, ціаноз, або холодний, липкий піт, або судоми " << endl;
	cin >> answer2;
	if (answer2 == 'a')
	{
		a++;
	}


	cout << "\tШлунково-кишковi розлади: " << "\n" << "\t\t a) вiдсутнiсть шлунково-кишкових розладiв (нудота, блювання, дiарея);" << "\n" << "\t\t" << " b) наявнiсть шлунково-кишкових розладiв (нудота, блювання та/або дiарея); " << endl;
	cin >> answer3;
	if (answer3 == 'a')
	{
		a++;
	}

	cout << "\tЗмiни свiдомостi: " << "\n" << "\t\t a) вiдсутнiсть змiн свiдомостi;" << "\n" << "\t\t" << " b) вiдсутнiсть порушення свiдомостi або млявiсть;" << "\n" << "\t\t c) порушення свiдомостi(дезорiєнтацiя, збудження, сплутанiсть, сопор);" << endl;
	cin >> answer4;
	if (answer4 == 'a')
	{
		a++;
	}

	cout << "\tОзнаки пневмонiї: " << "\n" << "\t\t a) вiдсутнi клiнiчнi ознаки пневмонiї (фiзикальнi змiни в легенях);" << "\n" << "\t\t" << " b) наявнi клiнiчнi ознаки пневмонiї (фiзикальнi змiни в легенях);" << "\n" << endl;
	cin >> answer5;
	if (answer5 == 'a')
	{
		a++;
	}

	cout << "\tОзнаки пневмонiї: " << "\n" << "\t\t a) вiдсутнi рентгенологiчнi ознаки пневмонiї;" << "\n" << "\t\t" << " b) наявнi рентгенологiчнi ознаки пневмонiї;" << "\n" << endl;
	cin >> answer6;
	if (answer6 == 'a')
	{
		a++;
	}


	cout << "\tВiк пацiєнта: " << "\n" << "\t\t a) вiк до 65 рокiв;" << "\n" << "\t\t" << " b) вiк понад 65 рокiв;" << "\n" << endl;
	cin >> answer7;
	if (answer7 == 'a')
	{
		a++;
	}

	cout << "\tВiк пацiєнта: " << "\n" << "\t\t a) пацiєнт не вiдноситься до групи ризику ;" << "\n" << "\t\t" << " b) пацiєнт вiдноситься до групи ризику (наявнiсть хоча б одного iз захворювань): наявнiсть хронiчна хвороба легень, важкi захворювання серцево-судинної системи в т.ч. з ускладненнями, iмуносупресивнi стани (первинний i вториннийi імунодефiцити), цукровий діабет (субкомпенсований, декомпенсований), ниркова недостатнiсть, тяжкi алергiчнi захворювання або стани, автоiмуннi стани - печiнкова недостатнiсть, цереброваскулярнi захворювання в стадiї декомпенсацiї, важке ожирiння (iндекс маси тiла ≥40) " << "\n" << endl;
	cin >> answer8;
	if (answer8 == 'a')
	{
		a++;
	}
	cout << "\tНаявнi такi симптоми, як утруднене дихання (неможливiсть говорити повних речень, втягування мiжребенних промiжкiв, дистанцiйнi хрипи тощо), або сатурацiя - spo2 нижче 93%, або кровохаркання, або тахi- , брадiпное або апное, або блiдiсть, мраморнiсть шкiрних покривiв, цiаноз, або холодний, липкий пiт, або судоми? " << " a) так, наявнi;" << "\n" << "\t\t" << " b) нi, такі симптоми відсутні " << endl;
	cin >> answer9;
	if (answer9 == 'a')
	{
		cout << "Реанімаційна допомога (госпіталізація в палату інтенсивної терапії)" << endl;
	}

	switch (a)
	{
	case 0:cout << "Cтаціонарна допомога (госпіталізація в провізорне відділення):" << endl;
	case 8:cout << "Амбулаторна допомога" << endl;
	}

}
/*
Завдання:
Анкета пацієнта з підозрою на COVID-19
при первинному медичному огляді:

Рівень 1- критерії амбулаторної допомоги:
•	гарячка до 38°С
•	гарячка добре контролюється прийомом жарознижуючих препаратів
•	сухим кашлем без задишки;
•	відсутністю шлунково-кишкових розладів (нудота, блювання, діарея);
•	відсутністю змін свідомості;
•	відсутні клінічних ознак пневмонії (фізикальні зміни в легенях)
•	відсутні рентгенологічних ознак пневмонії
•	вік до 65 років
•	пацієнт не відноситься до групи ризику
•	відсутність симптоми загостренням інших хронічної супутньої патології

Рівень 2 - критерії стаціонарної допомоги (госпіталізація в провізорне відділення):
•	гарячка вище 38°С, що не контролюється прийомом жарознижуючих препаратів
•	сухим кашлем із задишкою (SpO2>93%)
•	наявність шлунково-кишкових розладів (нудота, блювання та/або діарея);
•	відсутністю порушення свідомості або млявість
•	наявність клінічних ознаки пневмонії (фізикальні зміни в легенях)
•	наявність рентгенологічних ознак пневмонії
•	вік понад 65 років
•	пацієнт з групи ризику (наявність хоча б одного із захворювань):
−	наявність хронічна хвороба легень;
−	важкі захворювання серцево-судинної системи в т.ч. з ускладненнями;
−	імуносупресивні стани (первинний і вторинний імунодефіцити);
−	цукровий діабет (субкомпенсований, декомпенсований);
−	ниркова недостатність;
−	тяжкі алергічні захворювання або стани;
−	автоімунні стани - печінкова недостатність;
−	цереброваскулярні захворювання в стадії декомпенсації;
−	важке ожиріння (індекс маси тіла ≥40).
•	відсутність симптомів загостренням інших хронічної супутньої патології

Рівень 3 - критерії реанімаційної допомоги (госпіталізація в палату інтенсивної терапії):
•	утруднене дихання (неможливість говорити повних речень, втягування міжребенних проміжків, дистанційні хрипи тощо)
•	сатурація - spo2 нижче 93%
•	кровохаркання
•	тахі- , брадіпное або апное
•	блідість, мраморність шкірних покривів, ціаноз
•	холодний, липкий піт
•	порушення свідомості (дезорієнтація, збудження, сплутаність, сопор)
•	судоми
•	наявність шлунково-кишкових розладів (нудота, блювання та/або діарея)
•	наявність клінічних ознаки пневмонії (фізикальні зміни в легенях)
•	наявність рентгенологічних ознак пневмонії
•



*/